app/controllers/books_controller.rb

  def index
    @search = Book.search do
---
SELECT "books".* FROM "books"

  def create
    @book = Book.new(params[:book])

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("author", "created_at", "image", "review", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @book = Book.find(params[:id])

    respond_to do |format|
      if @book.update_attributes(params[:book])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "books" SET "title" = 'Harry Potter and the Sorceror''s Stone', "image" = 'harry-potter-1.jpg', "updated_at" = '2013-03-20 02:11:55.367885' WHERE "books"."id" = 9